In [1]:
import numpy as np
import pandas as pd

In [2]:
s1 = pd.Series([1,2,1,2,5], index=['a','b','c','d','e'])
s1.index=['가', '나', '다', '라', '마']
print(f"Series 인덱스 값 : \n{s1}")
s1.value_counts()

Series 인덱스 값 :
가    1
나    2
다    1
라    2
마    5
dtype: int64

1    2
2    2
5    1
dtype: int64

In [3]:
df = pd.DataFrame({'a':[10,20,30], 'b':[20,30,40], 'c':[31,32,33]})
print(f"DataFrame df : \n{df}")
print(f"DataFrame df.columns : \n{df.columns}")
print(f"DataFrame df.shape : \n{df.shape}")

DataFrame df :
    a   b   c
0  10  20  31
1  20  30  32
2  30  40  33
DataFrame df.columns :
Index(['a', 'b', 'c'], dtype='object')
DataFrame df.shape :
(3, 3)

In [4]:
names = ['kim','park', 'choi', 'lee']
ages = [20, 22, 21, 22]
genders = ['M', 'M', 'F', 'M']
data = {'names':names, 'ages':ages, 'genders':genders}
df1 = pd.DataFrame(data)
data
data2 = [names, ages, genders]
data2
df2 = pd.DataFrame(data2)
df2
df3 = df2.T
df3

      0   1  2
0   kim  20  M
1  park  22  M
2  choi  21  F
3   lee  22  M

In [5]:
names = ['kim', 'lee', 'choi', 'park', 'hong']
year = [2013, 2014, 2013, 2015, 2014]
points = [1.5, 1.7, 3.6, 2.4, 2.9]
data3 = [names, year, points]
df4 = pd.DataFrame(data3).T

In [6]:
#  필드 값 가지고 오기
# df4.info()
df4
print(df4[0])

0     kim
1     lee
2    choi
3    park
4    hong
Name: 0, dtype: object

In [17]:
df4[0]
df4.loc[{0, 4}]
df4.loc[{0 : 4}]
df4.loc[:2]

C:\Users\yang\AppData\Local\Temp\ipykernel_15720\1299252103.py:2: FutureWarning: Passing a set as an indexer is deprecated and will raise in a future version. Use a list instead.
  df4.loc[{0, 4}]
C:\Users\yang\AppData\Local\Temp\ipykernel_15720\1299252103.py:3: FutureWarning: Passing a dict as an indexer is deprecated and will raise in a future version. Use a list instead.
  df4.loc[{0 : 4}]

      0     1    2
0   kim  2013  1.5
1   lee  2014  1.7
2  choi  2013  3.6

In [21]:
df4.loc[df4[1]>=2014]

      0     1    2
1   lee  2014  1.7
3  park  2015  2.4
4  hong  2014  2.9